In [2]:
import numpy as np
import pandas as pd

In [5]:
dataframe = pd.read_excel("Ornek22.xlsx")

In [6]:
dataframe

  Unnamed: 0   Maas   Yas  Depatrman
0        Ali  200.0  35.0    Yazılım
1       Veli    NaN  25.0      Satış
2       Ayşe  400.0  19.0        NaN
3       Aslı  200.0  23.0  Pazarlama
4        Nur  150.0   NaN     Finans
5       Akın   50.0  30.0      Hukuk

In [7]:
doludataframe = dataframe.dropna()

In [8]:
doludataframe

  Unnamed: 0   Maas   Yas  Depatrman
0        Ali  200.0  35.0    Yazılım
3       Aslı  200.0  23.0  Pazarlama
5       Akın   50.0  30.0      Hukuk

In [9]:
#doludataframe.to_excel("yenidosya.xlsx")